Repository: dev-redoy-ahmed/emi-calculator
Catalog: lib/l10n/app_*.arb
Languages: bn, hi

source: Choose Language
bn: ভাষা নির্বাচন করুন
hi: भाषा चुनें

source: Find a language
bn: একটি ভাষা খুঁজুন
hi: एक भाषा खोजें

source: Loan Amount
bn: ঋণের পরিমাণ
hi: ऋण राशि

source: Interest Rate
bn: সুদের হার
hi: ब्याज दर

# loan_period
source: Loan Tenure
bn: ঋণের মেয়াদ
hi: ऋण अवधि

source: Processing Fee
bn: প্রসেসিং ফি
hi: प्रसंस्करण शुल्क

source: Years
bn: বছর
hi: वर्ष

source: Months
bn: মাস
hi: महीने

source: Calculate
bn: গণনা করুন
hi: गणना करें

source: Reset
bn: রিসেট করুন
hi: रीसेट करें

source: Details
bn: বিস্তারিত
hi: विवरण

source: Monthly EMI
bn: মাসিক EMI
hi: मासिक EMI

source: Total Interest
bn: মোট সুদ
hi: कुल ब्याज

source: Processing Fees
bn: প্রসেসিং ফি
hi: प्रसंस्करण शुल्क

source: Total Payment
bn: মোট অর্থপ্রদান
hi: कुल भुगतान

# enter_period
source: Enter loan period
bn: ঋণের সময়সীমা প্রবেশ করুন
hi: ऋण अवधि दर्ज करें

source: EMI Calculator
bn: EMI ক্যালকুলেটর
hi: EMI कैलकुलेटर

source: Loan Summary
bn: ঋণের সারসংক্ষেপ
hi: ऋण सारांश

source: Prepayment Calculator
bn: প্রিপেমেন্ট ক্যালকুলেটর
hi: पूर्व भुगतान कैलकुलेटर

source: Prepayment Amount
bn: প্রিপেমেন্ট পরিমাণ
hi: पूर्व भुगतान राशि

source: Enter prepayment amount
bn: প্রিপেমেন্ট পরিমাণ প্রবেশ করুন
hi: पूर्व भुगतान राशि दर्ज करें

source: Prepayment Month
bn: প্রিপেমেন্ট মাস
hi: पूर्व भुगतान माह

source: Enter prepayment month
bn: প্রিপেমেন্ট মাস প্রবেশ করুন
hi: पूर्व भुगतान माह दर्ज करें

source: Original Monthly EMI
bn: আসল মাসিক EMI
hi: मूल मासिक EMI

source: Revised Monthly EMI
bn: সংশোধিত মাসিক EMI
hi: संशोधित मासिक EMI

source: Original Tenure
bn: আসল মেয়াদ
hi: मूल अवधि

source: Revised Tenure
bn: সংশোধিত মেয়াদ
hi: संशोधित अवधि

source: Total Interest (Original)
bn: মোট সুদ (আসল)
hi: कुल ब्याज (मूल)

source: Total Interest (Revised)
bn: মোট সুদ (সংশোধিত)
hi: कुल ब्याज (संशोधित)

source: Total Payment (Original)
bn: মোট অর্থপ্রদান (আসল)
hi: कुल भुगतान (मूल)

source: Total Payment (Revised)
bn: মোট অর্থপ্রদান (সংশোধিত)
hi: कुल भुगतान (संशोधित)

source: Interest Saved
bn: সুদ সঞ্চয়
hi: बचाया गया ब्याज

source: Interest Rate Change (%)
bn: সুদের হার পরিবর্তন (%)
hi: ब्याज दर परिवर्तन (%)

source: Enter interest rate change
bn: সুদের হার পরিবর্তন প্রবেশ করুন
hi: ब्याज दर परिवर्तन दर्ज करें

# enter_value
source: Please enter a value
bn: একটি মান প্রবেশ করুন
hi: कृपया एक मान दर्ज करें

# years_hint
source: 1 year
bn: ১ বছর
hi: 1 वर्ष

# months_hint
source: 12 months
bn: ১২ মাস
hi: 12 महीने

# principal_component
source: Principal
bn: মূলধন
hi: मुख्य राशि

# interest_component
source: Interest
bn: সুদ
hi: ब्याज

source: Outstanding Balance
bn: বকেয়া ব্যালেন্স
hi: बकाया शेष

source: Month
bn: মাস
hi: महीना

source: Amortization Schedule
bn: অ্যামর্টাইজেশন সময়সূচি
hi: ऋण अदायगी अनुसूची

source: Step-up EMI Calculator
bn: স্টেপ-আপ EMI ক্যালকুলেটর
hi: स्टेप-अप EMI कैलकुलेटर

source: Yearly EMI
bn: বার্ষিক EMI
hi: वार्षिक EMI

source: Step-up Rate %
bn: স্টেপ-আপ হার %
hi: स्टेप-अप दर %

source: Enter step-up rate
bn: স্টেপ-আপ হার প্রবেশ করুন
hi: स्टेप-अप दर दर्ज करें

# step_up_frequency
source: Step-up Frequency (Years)
bn: স্টেপ-আপ ফ্রিকোয়েন্সি (বছর)
hi: स्टेप-अप आवृत्ति (वर्ष)

source: Enter step-up frequency
bn: স্টেপ-আপ ফ্রিকোয়েন্সি প্রবেশ করুন
hi: स्टेप-अप आवृत्ति दर्ज करें

# enter_interest
source: Enter interest rate
bn: সুদের হার প্রবেশ করুন
hi: ब्याज दर दर्ज करें

# enter_amount
source: Enter loan amount
bn: ঋণের পরিমাণ প্রবেশ করুন
hi: ऋण राशि दर्ज करें

source: Step-down EMI Calculator
bn: স্টেপ-ডাউন EMI ক্যালকুলেটর
hi: स्टेप-डाउन EMI कैलकुलेटर

source: Step-down Rate %
bn: স্টেপ-ডাউন হার %
hi: स्टेप-डाउन दर %

source: Enter step-down rate
bn: স্টেপ-ডাউন হার প্রবেশ করুন
hi: स्टेप-डाउन दर दर्ज करें

# step_down_frequency
source: Step-down Frequency (Years)
bn: স্টেপ-ডাউন ফ্রিকোয়েন্সি (বছর)
hi: स्टेप-डाउन आवृत्ति (वर्ष)

source: Enter step-down frequency
bn: স্টেপ-ডাউন ফ্রিকোয়েন্সি প্রবেশ করুন
hi: स्टेप-डाउन आवृत्ति दर्ज करें

source: Quick Calculator
bn: দ্রুত ক্যালকুলেটর
hi: त्वरित कैलकुलेटर

source: Moratorium EMI Calculator
bn: মোরাটোরিয়াম EMI ক্যালকুলেটর
hi: मोराटोरियम EMI कैलकुलेटर

# moratorium_period
source: Moratorium Period (Months)
bn: মোরাটোরিয়াম সময়সীমা (মাস)
hi: मोराटोरियम अवधि (महीने)

source: Enter moratorium period
bn: মোরাটোরিয়াম সময়সীমা প্রবেশ করুন
hi: मोराटोरियम अवधि दर्ज करें

source: Interest Rate Change Calculator
bn: সুদের হার পরিবর্তন ক্যালকুলেটর
hi: ब्याज दर परिवर्तन कैलकुलेटर

source: Original Interest Rate %
bn: আসল সুদের হার %
hi: मूल ब्याज दर %

source: New Interest Rate
bn: নতুন সুদের হার
hi: नया ब्याज दर

# enter_new_interest
source: Enter new interest rate
bn: নতুন সুদের হার প্রবেশ করুন
hi: नई ब्याज दर दर्ज करें

source: Original EMI
bn: আসল EMI
hi: मूल EMI

source: New EMI
bn: নতুন EMI
hi: नई EMI

source: EMI Difference
bn: EMI পার্থক্য
hi: EMI अंतर

source: Flat Rate EMI Calculator
bn: ফ্ল্যাট রেট EMI ক্যালকুলেটর
hi: फ्लैट रेट EMI कैलकुलेटर

source: Flat Interest Rate %
bn: ফ্ল্যাট সুদের হার %
hi: फ्लैट ब्याज दर %

# enter_flat_interest
source: Enter flat interest rate
bn: ফ্ল্যাট সুদের হার প্রবেশ করুন
hi: फ्लैट ब्याज दर दर्ज करें

source: Flat Rate
bn: ফ্ল্যাট রেট
hi: फ्लैट दर

source: Compound Interest Calculator
bn: চক্রবৃদ্ধি সুদ ক্যালকুলেটর
hi: चक्रवृद्धि ब्याज कैलकुलेटर

source: Principal Amount
bn: মূলধনের পরিমাণ
hi: मूल राशि

source: Enter principal amount
bn: মূলধনের পরিমাণ প্রবেশ করুন
hi: मूल राशि दर्ज करें

source: Compound Frequency
bn: চক্রবৃদ্ধি ফ্রিকোয়েন্সি
hi: चक्रवृद्धि आवृत्ति

source: Enter compound frequency
bn: চক্রবৃদ্ধি ফ্রিকোয়েন্সি প্রবেশ করুন
hi: चक्रवृद्धि आवृत्ति दर्ज करें

source: Maturity Amount
bn: পরিপক্বতা পরিমাণ
hi: परिपक्वता राशि

source: Total Interest Earned
bn: মোট সুদ অর্জন
hi: कुल अर्जित ब्याज

source: Period
bn: সময়সীমা
hi: अवधि

source: Credit Card Calculator
bn: ক্রেডিট কার্ড ক্যালকুলেটর
hi: क्रेडिट कार्ड कैलकुलेटर

source: Monthly Payment
bn: মাসিক পেমেন্ট
hi: मासिक भुगतान

source: Months to Pay Off
bn: পরিশোধ করতে মাস
hi: भुगतान करने के महीने

source: Total Amount Paid
bn: মোট অর্থপ্রদান
hi: कुल भुगतान राशि

source: Total Interest Paid
bn: মোট সুদ প্রদান
hi: कुल ब्याज भुगतान

source: Deposit
bn: জমা
hi: जमा

source: Withdrawal
bn: উত্তোলন
hi: निकासी

source: Error
bn: ত্রুটি
hi: त्रुटि

# overdraft_limit_error
source: Cannot withdraw beyond your overdraft limit
bn: আপনার ওভারড্রাফ্ট সীমার বাইরে উত্তোলন করা যাবে না
hi: ओवरड्राफ्ट सीमा से अधिक निकासी नहीं कर सकते

source: Cancel
bn: বাতিল করুন
hi: रद्द करें

source: Reset Confirmation
bn: রিসেট নিশ্চিতকরণ
hi: रीसेट की पुष्टि

# confirm_reset
source: Are you sure you want to reset?
bn: আপনি কি রিসেট করতে চান?
hi: क्या आप निश्चित रूप से रीसेट करना चाहते हैं?

source: Current Account Calculator
bn: কারেন্ট অ্যাকাউন্ট ক্যালকুলেটর
hi: चालू खाता कैलकुलेटर

source: Transaction Amount
bn: লেনদেনের পরিমাণ
hi: लेनदेन राशि

source: Withdraw
bn: উত্তোলন
hi: निकालें

source: Overdraft Limit
bn: ওভারড্রাফ্ট সীমা
hi: ओवरड्राफ्ट सीमा

source: Enter overdraft limit
bn: ওভারড্রাফ্ট সীমা প্রবেশ করুন
hi: ओवरड्राफ्ट सीमा दर्ज करें

source: Transaction History
bn: লেনদেনের ইতিহাস
hi: लेन-देन का इतिहास

source: Type
bn: ধরণ
hi: प्रकार

source: Amount
bn: পরিমাণ
hi: राशि

source: Balance
bn: ব্যালেন্স
hi: शेष राशि

source: Current Balance
bn: বর্তমান ব্যালেন্স
hi: वर्तमान शेष

source: Annually
bn: বার্ষিক
hi: वार्षिक

source: Monthly
bn: মাসিক
hi: मासिक

# enter_principal
source: Enter principal amount
bn: মূলধনের পরিমাণ প্রবেশ করুন
hi: मूल राशि दर्ज करें

# fd_calculator
source: Fixed Deposit Calculator
bn: ফিক্সড ডিপোজিট ক্যালকুলেটর
hi: फिक्स्ड डिपॉजिट कैलकुलेटर

source: PPF Calculator
bn: PPF ক্যালকুলেটর
hi: पीपीएफ कैलकुलेटर

source: Yearly Contribution
bn: বার্ষিক অবদান
hi: वार्षिक योगदान

source: Enter yearly contribution
bn: বার্ষিক অবদান প্রবেশ করুন
hi: वार्षिक योगदान दर्ज करें

source: Enter interest rate
bn: সুদের হার প্রবেশ করুন
hi: ब्याज दर दर्ज करें

source: Period (Years)
bn: সময়সীমা (বছর)
hi: अवधि (वर्ष)

source: Results
bn: ফলাফল
hi: परिणाम

source: Total Contribution
bn: মোট অবদান
hi: कुल योगदान

# rd_calculator
source: Recurring Deposit Calculator
bn: আবৃত্ত ডিপোজিট ক্যালকুলেটর
hi: आरडी कैलकुलेटर

source: Monthly Deposit
bn: মাসিক জমা
hi: मासिक जमा

source: Enter monthly deposit
bn: মাসিক জমা প্রবেশ করুন
hi: मासिक जमा दर्ज करें

source: Maturity Value
bn: পরিপক্বতা মান
hi: परिपक्वता मूल्य

source: Total Deposits
bn: মোট জমা
hi: कुल जमा

source: Savings Calculator
bn: সঞ্চয় ক্যালকুলেটর
hi: संचय कैलकुलेटर

source: Monthly Savings
bn: মাসিক সঞ্চয়
hi: मासिक संचय

source: Enter monthly savings
bn: মাসিক সঞ্চয় প্রবেশ করুন
hi: मासिक संचय दर्ज करें

source: Future Value
bn: ভবিষ্যত মূল্য
hi: भविष्य का मूल्य

source: Total Savings
bn: মোট সঞ্চয়
hi: कुल बचत

source: Rent vs Buy Calculator
bn: ভাড়া বনাম কেনা ক্যালকুলেটর
hi: किराया बनाम खरीद कैलकुलेटर

source: Monthly Rent
bn: মাসিক ভাড়া
hi: मासिक किराया

source: Home Price
bn: বাড়ির দাম
hi: घर की कीमत

source: Down Payment
bn: ডাউন পেমেন্ট
hi: डाउन पेमेंट

source: Property Tax Rate
bn: সম্পত্তি করের হার
hi: संपत्ति कर दर

# maintenance_cost
source: Maintenance Cost (Yearly)
bn: রক্ষণাবেক্ষণ খরচ (বার্ষিক)
hi: रखरखाव लागत (वार्षिक)

source: Appreciation Rate %
bn: মূল্য বৃদ্ধি হার %
hi: मूल्यवृद्धि दर %

source: Total Rent Cost
bn: মোট ভাড়ার খরচ
hi: कुल किराया लागत

source: Total Home Cost
bn: মোট বাড়ির খরচ
hi: कुल घर की लागत

# renting_cheaper
source: Renting is cheaper
bn: ভাড়া নেওয়া সস্তা
hi: किराया सस्ता है

# buying_cheaper
source: Buying is cheaper
bn: কেনা সস্তা
hi: खरीदना सस्ता है

# rent_savings
source: Renting saves
bn: ভাড়া সঞ্চয়
hi: किराये पर बचत

# buy_savings
source: Buying saves
bn: কেনা সঞ্চয়
hi: खरीदने पर बचत

source: Home Loan Affordability Calculator
bn: হোম লোন অ্যাফোর্ডেবিলিটি ক্যালকুলেটর
hi: गृह ऋण सामर्थ्य कैलकुलेटर

source: Monthly Income
bn: মাসিক আয়
hi: मासिक आय

source: Monthly Expenses
bn: মাসিক খরচ
hi: मासिक खर्चे

source: Loan Term (Years)
bn: ঋণের মেয়াদ (বছর)
hi: ऋण अवधि (वर्ष)

# max_loan_amount
source: Maximum Loan Amount
bn: সর্বাধিক ঋণ পরিমাণ
hi: अधिकतम ऋण राशि

source: Mortgage Refinance Calculator
bn: মর্টগেজ রিফাইন্যান্স ক্যালকুলেটর
hi: बंधक पुनर्वित्त कैलकुलेटर

source: Current Loan Amount
bn: বর্তমান ঋণের পরিমাণ
hi: वर्तमान ऋण राशि

source: Current Interest Rate
bn: বর্তমান সুদের হার
hi: वर्तमान ब्याज दर

source: Current Term (Years)
bn: বর্তমান মেয়াদ (বছর)
hi: वर्तमान अवधि (वर्ष)

source: New Loan Amount
bn: নতুন ঋণের পরিমাণ
hi: नया ऋण राशि

source: New Term (Years)
bn: নতুন মেয়াদ (বছর)
hi: नया अवधि (वर्ष)

source: Closing Costs
bn: ক্লোজিং খরচ
hi: बंद करने की लागत

source: Current Monthly Payment
bn: বর্তমান মাসিক পেমেন্ট
hi: वर्तमान मासिक भुगतान

source: New Monthly Payment
bn: নতুন মাসিক পেমেন্ট
hi: नया मासिक भुगतान

source: Rental Yield Calculator
bn: ভাড়ার ফলন ক্যালকুলেটর
hi: किराया उपज कैलकुलेटर

source: Property Purchase Price
bn: সম্পত্তি ক্রয় মূল্য
hi: संपत्ति खरीद मूल्य

source: Other Annual Expenses
bn: অন্যান্য বার্ষিক খরচ
hi: अन्य वार्षिक खर्च

source: Annual Rental Income
bn: বার্ষিক ভাড়ার আয়
hi: वार्षिक किराया आय

source: Rental Yield
bn: ভাড়ার ফলন
hi: किराया उपज

source: Home Equity Loan Calculator
bn: হোম ইকুইটি লোন ক্যালকুলেটর
hi: गृह इक्विटी ऋण कैलकुलेटर

source: Home Value
bn: বাড়ির মূল্য
hi: घर का मूल्य

source: Mortgage Balance
bn: মর্টগেজ ব্যালেন্স
hi: बंधक शेष

source: Loan-to-Value Ratio
bn: লোন-টু-ভ্যালু রেশিও
hi: ऋण-से-मूल्य अनुपात

source: Available Home Equity
bn: উপলব্ধ হোম ইকুইটি
hi: उपलब्ध गृह इक्विटी

source: Maximum Loan Amount
bn: সর্বাধিক ঋণ পরিমাণ
hi: अधिकतम ऋण राशि

source: GST Calculator
bn: GST ক্যালকুলেটর
hi: GST कैलकुलेटर

source: GST Rate (%)
bn: GST হার (%)
hi: GST दर (%)

source: Add GST (+)
bn: GST যোগ করুন (+)
hi: GST जोड़ें (+)

source: Remove GST (-)
bn: GST সরান (-)
hi: GST हटाएं (-)

source: Initial Amount
bn: প্রাথমিক পরিমাণ
hi: प्रारंभिक राशि

source: GST Amount
bn: GST পরিমাণ
hi: GST राशि

# total_with_gst
source: Total Amount (with GST)
bn: মোট পরিমাণ (GST সহ)
hi: GST के साथ कुल राशि

# total_without_gst
source: Total Amount (without GST)
bn: মোট পরিমাণ (GST ছাড়া)
hi: GST के बिना कुल राशि

source: Income Tax Calculator
bn: আয়কর ক্যালকুলেটর
hi: आयकर कैलकुलेटर

source: Annual Income
bn: বার্ষিক আয়
hi: वार्षिक आय

source: Deductions
bn: বিয়োগ
hi: कटौती

source: Apply GST
bn: GST প্রয়োগ করুন
hi: GST लागू करें

source: No GST
bn: কোন GST নেই
hi: GST नहीं

source: Your Tax Results
bn: আপনার করের ফলাফল
hi: आपके कर परिणाम

source: GST Applied
bn: GST প্রয়োগ হয়েছে
hi: GST लागू किया गया

source: Taxable Income
bn: করযোগ্য আয়
hi: कर योग्य आय

source: Total Income Tax
bn: মোট আয়কর
hi: कुल आयकर

source: Effective Tax Rate
bn: কার্যকর করের হার
hi: प्रभावी कर दर

# tax_slab_info
source: Tax Slab Information
bn: কর স্ল্যাব তথ্য
hi: कर स्लैब जानकारी

source: Slab 1
bn: স্ল্যাব ১
hi: स्लैब 1

source: Slab 2
bn: স্ল্যাব ২
hi: स्लैब 2

source: Slab 3
bn: স্ল্যাব ৩
hi: स्लैब 3

source: Slab 4
bn: স্ল্যাব ৪
hi: स्लैब 4

# tax_note
source: Tax Calculation Notes
bn: কর গণনা নোট
hi: कर गणना नोट्स

source: Net Investment Income Tax Calculator
bn: নেট বিনিয়োগ আয়কর ক্যালকুলেটর
hi: निवेश आय कर कैलकुलेटर

source: Investment Income
bn: বিনিয়োগ আয়
hi: निवेश आय

source: Net Investment Income Calculation
bn: নেট বিনিয়োগ আয় গণনা
hi: निवेश आय की गणना

source: Net Investment Income
bn: নেট বিনিয়োগ আয়
hi: निवेश आय

source: Tax Owed
bn: প্রদেয় কর
hi: बकाया कर

source: Tax Savings Calculator
bn: কর সঞ্চয় ক্যালকুলেটর
hi: कर बचत कैलकुलेटर

source: Total Income
bn: মোট আয়
hi: कुल आय

source: Total Deductions
bn: মোট বিয়োগ
hi: कुल कटौती

source: Tax Savings Calculation
bn: কর সঞ্চয় গণনা
hi: कर बचत की गणना

source: New Taxable Income
bn: নতুন করযোগ্য আয়
hi: नई कर योग्य आय

source: Tax Savings
bn: কর সঞ্চয়
hi: कर बचत

source: Final Amount (with GST)
bn: GST সহ চূড়ান্ত পরিমাণ
hi: GST के साथ अंतिम राशि

source: Final Amount (without GST)
bn: GST ছাড়া চূড়ান্ত পরিমাণ
hi: GST के बिना अंतिम राशि

source: VAT Calculator
bn: VAT ক্যালকুলেটর
hi: VAT कैलकुलेटर

source: VAT Rate (%)
bn: VAT হার (%)
hi: VAT दर (%)

source: Add VAT (+)
bn: VAT যোগ করুন (+)
hi: VAT जोड़ें (+)

source: Remove VAT (-)
bn: VAT সরান (-)
hi: VAT हटाएं (-)

source: VAT Calculation
bn: VAT গণনা
hi: VAT की गणना

source: Total Amount (with VAT)
bn: মোট পরিমাণ (VAT সহ)
hi: VAT के साथ कुल राशि

source: Total Amount (without VAT)
bn: মোট পরিমাণ (VAT ছাড়া)
hi: VAT के बिना कुल राशि

source: Close
bn: বন্ধ করুন
hi: बंद करें

source: Total Cost
bn: মোট খরচ
hi: कुल लागत

source: Financial Calculator
bn: আর্থিক ক্যালকুলেটর
hi: वित्तीय कैलकुलेटर

source: Change Language
bn: ভাষা পরিবর্তন করুন
hi: भाषा बदलें

source: Select Country
bn: দেশ নির্বাচন করুন
hi: देश चुनें

source: Toggle Theme
bn: থিম পরিবর্তন করুন
hi: थीम बदलें

source: Tax Calculators
bn: কর ক্যালকুলেটর

source: Income Tax
bn: আয়কর

source: GST Calculator
bn: GST ক্যালকুলেটর

source: VAT Calculator
bn: VAT ক্যালকুলেটর

source: Tax Savings
bn: কর সঞ্চয়

source: Net Investment Income Tax
bn: নেট বিনিয়োগ আয়কর

# realEstateCategory
source: Real Estate & Property
bn: রিয়েল এস্টেট এবং সম্পত্তি

source: Home Loan Affordability
bn: হোম লোন অ্যাফোর্ডেবিলিটি

source: Rent vs Buy
bn: ভাড়া বনাম কেনা

source: Rental Yield
bn: ভাড়ার ফলন

source: Mortgage Refinance
bn: মর্টগেজ রিফাইন্যান্স

source: Loan Calculators
bn: ঋণ ক্যালকুলেটর

source: Loan Comparison
bn: ঋণ তুলনা

source: Loan Eligibility
bn: ঋণ যোগ্যতা

source: Personal Loan EMI
bn: ব্যক্তিগত ঋণ EMI

source: Business Loan EMI
bn: ব্যবসায়িক ঋণ EMI

source: Balance Transfer
bn: ব্যালেন্স ট্রান্সফার

source: Investment
bn: বিনিয়োগ ক্যালকুলেটর

source: SIP Calculator
bn: SIP ক্যালকুলেটর

source: ROI Calculator
bn: ROI ক্যালকুলেটর

source: Lump Sum Investment
bn: লাম্প সাম বিনিয়োগ

source: CAGR Calculator
bn: CAGR ক্যালকুলেটর

source: Dividend Yield
bn: ডিভিডেন্ড ফলন

source: EMI Calculators
bn: EMI ক্যালকুলেটর

# emiCalculator
source: EMI Calculators
bn: EMI ক্যালকুলেটর

source: Advanced EMI
bn: অ্যাডভান্সড EMI

source: Quick EMI
bn: দ্রুত EMI

source: Moratorium EMI
bn: মোরাটোরিয়াম EMI

source: Pre-payment
bn: প্রিপেমেন্ট

source: Interest Rate
bn: সুদের হার

source: Step-up EMI
bn: স্টেপ-আপ EMI

source: Step-down EMI
bn: স্টেপ-ডাউন EMI

source: Flat Rate EMI
bn: ফ্ল্যাট রেট EMI

# banking
source: Banking Calculators
bn: ব্যাংকিং ক্যালকুলেটর

source: RD Calculator
bn: RD ক্যালকুলেটর

source: FD Calculator
bn: FD ক্যালকুলেটর

source: Compound Interest
bn: চক্রবৃদ্ধি সুদ

source: Savings
bn: সঞ্চয়

source: Credit Card
bn: ক্রেডিট কার্ড

source: Current Account
bn: কারেন্ট অ্যাকাউন্ট

source: Home Equity Loan
bn: হোম ইকুইটি লোন
